cask_args appdir: "~/Applications", require_sha: true

# Emacs
brew "cmake"
brew "coreutils"
brew "fd"
brew "gnupg"
brew "gnuplot"
brew "ripgrep"


# Dev tools
brew "dasel"
cask "docker"
brew "direnv"
brew "fzf"
brew "gh"
brew "kubernetes-cli"
brew "kubectx"
brew "node"
brew "pandoc"
brew "rustup-init"
brew "terraform"

# Applications
# brew "stats"
cask "firefox"
cask "fleet"
cask "pycharm"

# Fonts
tap "homebrew/cask"
cask "font-fira-code"

# Misc
cask "spotify"
